<a href="https://colab.research.google.com/github/MariaGabrielp/HR_Analitica/blob/main/Perez_Gonzalez_HR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [129]:
import warnings
warnings.filterwarnings("ignore")

In [130]:
###Librerias
import pandas as pd ### Manejo de datos
import sqlite3 as sql #### Bases de datos y archivos sql
#import a_funciones as funciones  ### Archivo de funciones propias
#import sys ## saber ruta de la que carga paquetes
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

**Lectura de datos**

In [131]:
df_survey = pd.read_csv("https://raw.githubusercontent.com/MariaGabrielp/HR_Analitica/main/Datos/employee_survey_data.csv")
df_general = pd.read_csv("https://raw.githubusercontent.com/MariaGabrielp/HR_Analitica/main/Datos/general_data.csv")
df_manager = pd.read_csv("https://raw.githubusercontent.com/MariaGabrielp/HR_Analitica/main/Datos/manager_survey.csv")
df_retir = pd.read_csv("https://raw.githubusercontent.com/MariaGabrielp/HR_Analitica/main/Datos/retirement_info.csv")

##Preprocesamiento de datos

**Vista preliminar de las bases de datos, nulos, categorias y outliners**

Survey- Encuesta realizada a los empleados sobre satisfacción laboral a final de cada año, se tienen el histórico de dos encuestas, la realizada el 31-12-2015 y la que se realizó el 31-12-2016.

In [132]:
df_survey.head()

,Unnamed: 0,EmployeeID,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,DateSurvey
0,0,1,3.0,4.0,2.0,2015-12-31
1,1,2,3.0,2.0,4.0,2015-12-31
2,2,3,2.0,2.0,1.0,2015-12-31
3,3,4,4.0,4.0,3.0,2015-12-31
4,4,5,4.0,1.0,3.0,2015-12-31

In [133]:
df_general.head()

,Unnamed: 0,Age,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager,InfoDate
0,0,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,Y,11,8,0,1.0,6,1,0,0,2015-12-31
1,1,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,Y,23,8,1,6.0,3,5,1,4,2015-12-31
2,2,32,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,Y,15,8,3,5.0,2,5,0,3,2015-12-31
3,3,38,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,...,Y,11,8,3,13.0,5,8,7,5,2015-12-31
4,4,32,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,...,Y,12,8,2,9.0,2,6,0,4,2015-12-31

In [134]:
df_manager.head()

   Unnamed: 0  EmployeeID  JobInvolvement  PerformanceRating  SurveyDate
0           0           1               3                  3  2015-12-31
1           1           2               2                  4  2015-12-31
2           2           3               3                  3  2015-12-31
3           3           4               2                  3  2015-12-31
4           4           5               3                  3  2015-12-31

In [135]:
df_retir.head()

,Unnamed: 0.1,Unnamed: 0,EmployeeID,Attrition,retirementDate,retirementType,resignationReason
0,0,0,2,Yes,2016-10-15,Resignation,Others
1,1,1,7,Yes,2016-07-20,Resignation,Stress
2,2,2,14,Yes,2016-11-08,Resignation,Others
3,3,3,29,Yes,2016-10-15,Resignation,Others
4,4,4,31,Yes,2016-02-08,Resignation,Salary

In [136]:
###### Verificar lectura correcta de los datos

df_survey.sort_values(by=['EmployeeID'],ascending=1).head(5)

,Unnamed: 0,EmployeeID,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,DateSurvey
0,0,1,3.0,4.0,2.0,2015-12-31
4410,0,1,3.0,4.0,2.0,2016-12-31
4411,1,2,3.0,2.0,4.0,2016-12-31
1,1,2,3.0,2.0,4.0,2015-12-31
2,2,3,2.0,2.0,1.0,2015-12-31

In [137]:
df_survey.sort_values(by=["EmployeeID"],ascending=1).head(5)

,Unnamed: 0,EmployeeID,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,DateSurvey
0,0,1,3.0,4.0,2.0,2015-12-31
4410,0,1,3.0,4.0,2.0,2016-12-31
4411,1,2,3.0,2.0,4.0,2016-12-31
1,1,2,3.0,2.0,4.0,2015-12-31
2,2,3,2.0,2.0,1.0,2015-12-31

In [138]:
df_general.sort_values(by=["EmployeeID"],ascending=1).head(5)

,Unnamed: 0,Age,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager,InfoDate
0,0,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,Y,11,8,0,1.0,6,1,0,0,2015-12-31
4410,0,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,Y,11,8,0,1.0,6,1,0,0,2016-12-31
4411,1,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,Y,23,8,1,6.0,3,5,1,4,2016-12-31
1,1,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,Y,23,8,1,6.0,3,5,1,4,2015-12-31
2,2,32,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,Y,15,8,3,5.0,2,5,0,3,2015-12-31

In [139]:
df_manager.sort_values(by=["EmployeeID"],ascending=1).head(5)

      Unnamed: 0  EmployeeID  JobInvolvement  PerformanceRating  SurveyDate
0              0           1               3                  3  2015-12-31
4410           0           1               3                  3  2016-12-31
4411           1           2               2                  4  2016-12-31
1              1           2               2                  4  2015-12-31
2              2           3               3                  3  2015-12-31

In [140]:
df_retir.sort_values(by=["EmployeeID"],ascending=1).head(5)

,Unnamed: 0.1,Unnamed: 0,EmployeeID,Attrition,retirementDate,retirementType,resignationReason
0,0,0,2,Yes,2016-10-15,Resignation,Others
1,1,1,7,Yes,2016-07-20,Resignation,Stress
2,2,2,14,Yes,2016-11-08,Resignation,Others
3,3,3,29,Yes,2016-10-15,Resignation,Others
4,4,4,31,Yes,2016-02-08,Resignation,Salary

In [141]:
#Procedemos a unir las tablas para que sea mas fácil trabajarlas
dftotal=df_survey.merge(df_general, on="EmployeeID", how="left")
dftotal2=dftotal.merge(df_manager, on="EmployeeID", how="left")
dftotal3=dftotal2.merge(df_retir, on="EmployeeID", how="left")
# Tenemos finalmente un solo dataframe combinado con todas las tablas a partir de la columna ID
dfdata=dftotal3.copy()
dfdata.head()

,Unnamed: 0_x,EmployeeID,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,DateSurvey,Unnamed: 0_y,Age,BusinessTravel,Department,...,Unnamed: 0_x,JobInvolvement,PerformanceRating,SurveyDate,Unnamed: 0.1,Unnamed: 0_y,Attrition,retirementDate,retirementType,resignationReason
0,0,1,3.0,4.0,2.0,2015-12-31,0,51,Travel_Rarely,Sales,...,0,3,3,2015-12-31,NaN,NaN,NaN,NaN,NaN,NaN
1,0,1,3.0,4.0,2.0,2015-12-31,0,51,Travel_Rarely,Sales,...,0,3,3,2016-12-31,NaN,NaN,NaN,NaN,NaN,NaN
2,0,1,3.0,4.0,2.0,2015-12-31,0,51,Travel_Rarely,Sales,...,0,3,3,2015-12-31,NaN,NaN,NaN,NaN,NaN,NaN
3,0,1,3.0,4.0,2.0,2015-12-31,0,51,Travel_Rarely,Sales,...,0,3,3,2016-12-31,NaN,NaN,NaN,NaN,NaN,NaN
4,1,2,3.0,2.0,4.0,2015-12-31,1,31,Travel_Frequently,Research & Development,...,1,2,4,2015-12-31,0.0,0.0,Yes,2016-10-15,Resignation,Others

In [142]:
# Obtener la cantidad de valores únicos en cada columna
nunique_values = dfdata.nunique()

# Seleccionar las columnas con un solo valor
single_value_columns = nunique_values[nunique_values == 1].index

print("Variables con un único valor: ", single_value_columns)

Variables con un único valor:  Index(['EmployeeCount', 'Over18', 'StandardHours', 'Attrition'], dtype='object')

In [143]:
### las variables 'EmployeeCount', 'Over18', 'StandardHours', 'Attrition'... cuentan con un unico valor, lo que no aportaria a nuestro modelo por ende seran eliminadas
### Eliminacion de variables 
columns_to_drop = ['EmployeeCount', 'Over18', 'StandardHours', 'Attrition']
dfdata = dfdata.drop(columns=columns_to_drop)
### otras variables que no aportan, ni me dicen nada 
columns_to_drop = ['Unnamed: 0_x', 'Unnamed: 0_y', 'Unnamed: 0_x', 'Unnamed: 0.1', 'Unnamed: 0_y']
dfdata = dfdata.drop(columns=columns_to_drop)

In [144]:
## Verificación de valores nulos
print(dfdata.isnull().sum())

EmployeeID                     0
EnvironmentSatisfaction      200
JobSatisfaction              160
WorkLifeBalance              304
DateSurvey                     0
Age                            0
BusinessTravel                 0
Department                     0
DistanceFromHome               0
Education                      0
EducationField                 0
Gender                         0
JobLevel                       0
JobRole                        0
MaritalStatus                  0
MonthlyIncome                  0
NumCompaniesWorked           152
PercentSalaryHike              0
StockOptionLevel               0
TotalWorkingYears             72
TrainingTimesLastYear          0
YearsAtCompany                 0
YearsSinceLastPromotion        0
YearsWithCurrManager           0
InfoDate                       0
JobInvolvement                 0
PerformanceRating              0
SurveyDate                     0
retirementDate             29592
retirementType             29592
resignationReason          30152
dtype: int64

In [145]:
##tratamiento de nulos 
print(dfdata['EnvironmentSatisfaction'].value_counts())
print(dfdata['EnvironmentSatisfaction'].mean())
print(dfdata['EnvironmentSatisfaction'].median())
print('-------------------------------')

print(dfdata['JobSatisfaction'].value_counts())
print(dfdata['JobSatisfaction'].mean())
print(dfdata['JobSatisfaction'].median())
print('-------------------------------')

print(dfdata['WorkLifeBalance'].value_counts())
print(dfdata['WorkLifeBalance'].mean())
print(dfdata['WorkLifeBalance'].median())
print('-------------------------------')

print(dfdata['NumCompaniesWorked'].value_counts())
print(dfdata['NumCompaniesWorked'].mean())
print(dfdata['NumCompaniesWorked'].median())
print('-------------------------------')

3.0    10800
4.0    10672
2.0     6848
1.0     6760
Name: EnvironmentSatisfaction, dtype: int64
2.7236031927023947
3.0
-------------------------------
4.0    10936
3.0    10584
1.0     6880
2.0     6720
Name: JobSatisfaction, dtype: int64
2.728246013667426
3.0
-------------------------------
3.0    21280
2.0     8152
4.0     3632
1.0     1912
Name: WorkLifeBalance, dtype: int64
2.7614364135407135
3.0
-------------------------------
1.0    12464
0.0     4688
3.0     3792
2.0     3504
4.0     3320
7.0     1776
6.0     1664
5.0     1496
9.0     1248
8.0     1176
Name: NumCompaniesWorked, dtype: int64
2.6948303347756775
2.0
-------------------------------

In [146]:
##al ser el valor que mas aparece, la media sea 3 y la moda de un valor muy cercano a 3; los nulos de esta variable seran reemplazado por 3
dfdata['EnvironmentSatisfaction'] = dfdata['EnvironmentSatisfaction'].fillna(3.0)
dfdata['JobSatisfaction'] = dfdata['JobSatisfaction'].fillna(3.0)
dfdata['WorkLifeBalance'] = dfdata['WorkLifeBalance'].fillna(3.0)
##al ser una variable que cuenta con muy pocos nulos (numero de compañias en las que ha trabajo) los nulos se reemplazaran con el valor que mas aparece en la columna(1.0)
dfdata['NumCompaniesWorked'] = dfdata['NumCompaniesWorked'].fillna(1.0)

In [152]:
###Se puede observar que total working years tiene datos faltantes, sin embargo son 72; una cantidad que en comparacion con el total de la variable es muy poca... por lo que se procede a la ampuacion de estos datos debido a que no afectaria a la variable 
dfdata = dfdata.dropna(subset=['TotalWorkingYears'])

In [153]:
print(dfdata.isnull().sum())

EmployeeID                     0
EnvironmentSatisfaction        0
JobSatisfaction                0
WorkLifeBalance                0
DateSurvey                     0
Age                            0
BusinessTravel                 0
Department                     0
DistanceFromHome               0
Education                      0
EducationField                 0
Gender                         0
JobLevel                       0
JobRole                        0
MaritalStatus                  0
MonthlyIncome                  0
NumCompaniesWorked             0
PercentSalaryHike              0
StockOptionLevel               0
TotalWorkingYears              0
TrainingTimesLastYear          0
YearsAtCompany                 0
YearsSinceLastPromotion        0
YearsWithCurrManager           0
InfoDate                       0
JobInvolvement                 0
PerformanceRating              0
SurveyDate                     0
retirementDate             29536
retirementType             29536
resignationReason          30096
dtype: int64

In [149]:
##### por ultimo se revisa que las variables tengan su tipo de dato sea el correcto 
print(dfdata.head(4))
print(dfdata.dtypes)

   EmployeeID  EnvironmentSatisfaction  JobSatisfaction  WorkLifeBalance  \
0           1                      3.0              4.0              2.0
1           1                      3.0              4.0              2.0
2           1                      3.0              4.0              2.0
3           1                      3.0              4.0              2.0

   DateSurvey  Age BusinessTravel Department  DistanceFromHome  Education  \
0  2015-12-31   51  Travel_Rarely      Sales                 6          2
1  2015-12-31   51  Travel_Rarely      Sales                 6          2
2  2015-12-31   51  Travel_Rarely      Sales                 6          2
3  2015-12-31   51  Travel_Rarely      Sales                 6          2

   ... YearsAtCompany YearsSinceLastPromotion  YearsWithCurrManager  \
0  ...              1                       0                     0
1  ...              1                       0                     0
2  ...              1                       0                     0
3  ...              1                       0                     0

     InfoDate JobInvolvement  PerformanceRating  SurveyDate  retirementDate  \
0  2015-12-31              3                  3  2015-12-31             NaN
1  2015-12-31              3                  3  2016-12-31             NaN
2  2016-12-31              3                  3  2015-12-31             NaN
3  2016-12-31              3                  3  2016-12-31             NaN

   retirementType  resignationReason
0             NaN                NaN
1             NaN                NaN
2             NaN                NaN
3             NaN                NaN

[4 rows x 31 columns]
EmployeeID                   int64
EnvironmentSatisfaction    float64
JobSatisfaction            float64
WorkLifeBalance            float64
DateSurvey                  object
Age                          int64
BusinessTravel              object
Department                  object
DistanceFromHome             int64
Education                    int64
EducationField              object
Gender                      object
JobLevel                     int64
JobRole                     object
MaritalStatus               object
MonthlyIncome                int64
NumCompaniesWorked         float64
PercentSalaryHike            int64
StockOptionLevel             int64
TotalWorkingYears          float64
TrainingTimesLastYear        int64
YearsAtCompany               int64
YearsSinceLastPromotion      int64
YearsWithCurrManager         int64
InfoDate                    object
JobInvolvement               int64
PerformanceRating            int64
SurveyDate                  object
retirementDate              object
retirementType              object
resignationReason           object
dtype: object

In [150]:
# Para cambiar el tipo se dato puede utilizar la función astype de pandas
dfdata['DateSurvey'] = pd.to_datetime(dfdata['DateSurvey'])
dfdata['retirementDate'] = pd.to_datetime(dfdata['retirementDate'])
dfdata['SurveyDate'] = pd.to_datetime(dfdata['SurveyDate'])
dfdata['InfoDate'] = pd.to_datetime(dfdata['InfoDate'])